# **Pandas First Steps**

### A.J. Zerouali (21/07/07)

My first steps in Pandas. Will follow:

- Pierian Data's lectures in Sections 6-7 of DSML course.

- Lazy Programmer's Section 4 of "Numpy stack - Deep Learning Prerequisites"


The Pandas package is Python's version of Excel.

___________________________________________

## **Contents**

I - Series

II - Data Frames

III - Missing data

IV - Groupby

V - Merging, joining and concatenating

VI - More operations on data frames

VII - Data input and output

In [1]:
# Import Numpy and Pandas
import numpy as np
import pandas as pd

__________________________________________

# **I - Series**

This is Lecture 26, Sec. 6 of Pierian Data's DSML Bootcamp.

## **(1) Series basics**

Series are the Pandas version of Numpy's arrays, the main advantage here is that the indices of containers are viewed as modifiable labels, and that we can form the series from several Python containers (lists, arrays, dictionaries etc.). Creating a series is done using **pd.Series(data = [...], index = [labels])** (as a convention, "pd" is the shorthand name of  Pandas). To access an element of a series, one simply uses the labels (The difference with dictionaries??)

In [10]:
# Series from a dictionary
ex_dictionary_series = pd.Series({"Label 1":[5, 10, 15], "Label 2":[20, 25, 30],"Label 3":[35, 40, 45]})
print(f"ex_dictionary_series =\n{ex_dictionary_series}\n")
print(f"ex_dictionary_series[\"Label 2\"] =\n{ex_dictionary_series['Label 2']}" )

ex_dictionary_series =
Label 1     [5, 10, 15]
Label 2    [20, 25, 30]
Label 3    [35, 40, 45]
dtype: object

ex_dictionary_series["Label 2"] =
[20, 25, 30]

In [11]:
## Series from two lists
data_lst = [20, 25, 30]
label_lst = ["Label A", "Label B", "Label C"]
ex_list_series = pd.Series(data_lst, label_lst)
print(f"ex_list_series = \n{ex_list_series}\n")
print(f"ex_list_series[\'Label A\'] = {ex_list_series['Label A']}")

ex_list_series =
Label A    20
Label B    25
Label C    30
dtype: int64

ex_list_series['Label A'] = 20

In [14]:
# Will also work if a list is replaced by an array, which is very useful for ML applications
#ex_array = np.array([[5, 10, 15], [20, 25, 30],[35, 40, 45]]) gives an error. Must be 1-dimensional...
ex_array = np.array([35, 40, 45])
ex_array_series = pd.Series(ex_array, label_lst)
print(ex_array_series)
print(f"type(ex_array_series) = {type(ex_array_series)}")

Label A    35
Label B    40
Label C    45
dtype: int32
type(ex_array_series) = <class 'pandas.core.series.Series'>

In [13]:
# By default, the indices are integers starting at 0.
pd.Series([20,30,40])

0    20
1    30
2    40
dtype: int64

____________________________

# **II - Data Frames Fundamentals**

Here we follow Lectures 27-29 of Pierian Data DSML.

## Notes:

- Might need a comment on why operations are not done in-place by default (lect. 27).

## **(1) Data Frames Basics**

From Lecture 27. Data frames are the main data structure of Pandas. They're constructted using **pd.DataFrame(data, [Y-Labels], [X-Labels])** (note capitalization, **DataFrame**). Each column of a data frame is a series.

In [2]:
ex_matrix = np.random.randn(4,5)
print(ex_matrix)

[[ 0.35114824  0.14925078 -0.57078416  0.3482539   0.9031383 ]
 [ 0.26854669  0.67957216  0.64652167  0.018135   -0.3384719 ]
 [-0.17249605  0.84840654 -0.1285054  -0.99343118  0.21455205]
 [ 0.11788317 -1.47094311  0.06955596 -0.53493506  0.12526593]]

In [4]:
# Pandas gives a nice display
ex_dataframe = pd.DataFrame(ex_matrix, ["1", "2", "3", "4"], ["A", "B", "C", "D", "E"])
print(ex_dataframe)

          A         B         C         D         E
1  0.351148  0.149251 -0.570784  0.348254  0.903138
2  0.268547  0.679572  0.646522  0.018135 -0.338472
3 -0.172496  0.848407 -0.128505 -0.993431  0.214552
4  0.117883 -1.470943  0.069556 -0.534935  0.125266

* The output of a data frame is particularly nice:

In [5]:
ex_dataframe

          A         B         C         D         E
1  0.351148  0.149251 -0.570784  0.348254  0.903138
2  0.268547  0.679572  0.646522  0.018135 -0.338472
3 -0.172496  0.848407 -0.128505 -0.993431  0.214552
4  0.117883 -1.470943  0.069556 -0.534935  0.125266

* Data frames also have a shape attribute (since built over Numpy):

In [25]:
ex_dataframe.shape

(4, 5)

* Each column of a data frame is a Pandas series, one accesses a column using **data_frame['Column label']**:

In [18]:
print(f"ex_dataframe[\"C\"] = \n{ex_dataframe['C']}\n")
print(f"type(ex_dataframe[\"C\"]) = {type(ex_dataframe['C'])}")

ex_dataframe["C"] =
1   -0.570784
2    0.646522
3   -0.128505
4    0.069556
Name: C, dtype: float64

type(ex_dataframe["C"]) = <class 'pandas.core.series.Series'>

* Can also display subsets of initial data frame, by passing a **list** inside the brackets:

In [24]:
print(f"ex_dataframe[\"C\",\"E\",\"B\"] = \n{ex_dataframe[['C','E','B']]}\n")

ex_dataframe["C","E","B"] =
          C         E         B
1 -0.570784  0.903138  0.149251
2  0.646522 -0.338472  0.679572
3 -0.128505  0.214552  0.848407
4  0.069556  0.125266 -1.470943

* Like wise, every row of a data frame can be extracted as a series. This is done using the **.loc['Row label']** method, with **brackets, not parentheses** (Pandas calls rows "Properties"):

In [26]:
print(f"ex_dataframe.loc['2'] =\n{ex_dataframe.loc['2']}")

ex_dataframe.loc['2'] =
A    0.268547
B    0.679572
C    0.646522
D    0.018135
E   -0.338472
Name: 2, dtype: float64

In [ ]:
print(f"ex_dataframe.loc['2'] =\n{ex_dataframe.loc['2']}")

In [27]:
ex_dataframe.loc[['2','4']]

          A         B         C         D         E
2  0.268547  0.679572  0.646522  0.018135 -0.338472
4  0.117883 -1.470943  0.069556 -0.534935  0.125266

* Alternatively, can access the rows with the usual array indices instead of labels, using the **.iloc[[indices list]]** method:

In [28]:
ex_dataframe.iloc[[1,3]]

          A         B         C         D         E
2  0.268547  0.679572  0.646522  0.018135 -0.338472
4  0.117883 -1.470943  0.069556 -0.534935  0.125266

* Now to access the contents of a specific entry **.loc['Row label', 'Col. label']** of the data frame :

In [29]:
ex_dataframe.loc['2','C']

0.6465216689760965

* Also works to extract subset of data frame:

In [30]:
ex_dataframe.loc[['2','4'],['E','C']]

          E         C
2 -0.338472  0.646522
4  0.125266  0.069556

## **(2) Operations on Data Frames**

In [52]:
ex_dataframe_1 = pd.DataFrame(np.random.randn(4,5), ['R1','R2','R3','R4'], ['C1','C2','C3','C4','C5'])
ex_series_r = pd.Series(np.arange(5), ['C1','C2','C3','C4','C5'])
ex_series_s = pd.Series(['x','y','z','w','t'], ['C1','C2','C3','C4','C5'])
ex_dataframe_2 = pd.DataFrame(np.random.randn(4,5), ['R1','R2','R3','R4'], ['C1','C2','C3','C4','C5'])

In [53]:
ex_dataframe_1

          C1        C2        C3        C4        C5
R1  0.321277 -1.297490  0.164878  0.489730 -0.420024
R2  0.963872  0.070821 -0.727547 -1.016918 -0.504934
R3 -0.509867 -0.010599 -0.599602 -1.185855 -1.389545
R4 -0.341243  0.557779 -1.329904 -2.000770  0.270937

* One way to addd a new column is to directly assign it to a new label:

In [54]:
# Add new column
ex_dataframe_tmp = ex_dataframe_1
ex_dataframe_tmp['New col.'] = [10,15,20,25]
ex_dataframe_tmp

          C1        C2        C3        C4        C5  New col.
R1  0.321277 -1.297490  0.164878  0.489730 -0.420024        10
R2  0.963872  0.070821 -0.727547 -1.016918 -0.504934        15
R3 -0.509867 -0.010599 -0.599602 -1.185855 -1.389545        20
R4 -0.341243  0.557779 -1.329904 -2.000770  0.270937        25

* The other operation is to drop a row or a column from a data frame, which uses the method **.drop('Row label', axis =0, inplace = False)**. Note that:

- **.drop()** will remove a row, but **not in-place**.

- To drop a column, need to specify **axis = 1** in the second argument.

- **.drop()** creates a **new instance** of the data frame from which the indicated rows/columns have been removed. If we want to permanently remove elements, one specifies **inplace = True**.

In [55]:
ex_dataframe_2

          C1        C2        C3        C4        C5
R1  0.139724 -1.251075  0.351703 -0.023025  0.850264
R2 -0.788773  0.657919  1.352167 -0.635367  0.559823
R3 -1.952329 -0.614121 -0.443811 -0.699137 -0.443617
R4  1.706844 -0.324072  1.333450  0.475820 -0.047583

In [56]:
ex_dataframe_2.drop('R4')

          C1        C2        C3        C4        C5
R1  0.139724 -1.251075  0.351703 -0.023025  0.850264
R2 -0.788773  0.657919  1.352167 -0.635367  0.559823
R3 -1.952329 -0.614121 -0.443811 -0.699137 -0.443617

In [57]:
ex_dataframe_2.drop('C2', axis = 1)

          C1        C3        C4        C5
R1  0.139724  0.351703 -0.023025  0.850264
R2 -0.788773  1.352167 -0.635367  0.559823
R3 -1.952329 -0.443811 -0.699137 -0.443617
R4  1.706844  1.333450  0.475820 -0.047583

In [58]:
ex_dataframe_2

          C1        C2        C3        C4        C5
R1  0.139724 -1.251075  0.351703 -0.023025  0.850264
R2 -0.788773  0.657919  1.352167 -0.635367  0.559823
R3 -1.952329 -0.614121 -0.443811 -0.699137 -0.443617
R4  1.706844 -0.324072  1.333450  0.475820 -0.047583

In [60]:
ex_dataframe_temp = ex_dataframe_2
ex_dataframe_temp.drop('C2', axis = 1, inplace = True)

In [61]:
ex_dataframe_temp

          C1        C3        C4        C5
R1  0.139724  0.351703 -0.023025  0.850264
R2 -0.788773  1.352167 -0.635367  0.559823
R3 -1.952329 -0.443811 -0.699137 -0.443617
R4  1.706844  1.333450  0.475820 -0.047583

In [63]:
# Python didn't make a copy, it used pointers
ex_dataframe_2

          C1        C3        C4        C5
R1  0.139724  0.351703 -0.023025  0.850264
R2 -0.788773  1.352167 -0.635367  0.559823
R3 -1.952329 -0.443811 -0.699137 -0.443617
R4  1.706844  1.333450  0.475820 -0.047583

## **(2) Conditional selection in data frames**

From Lecture 28. This part is about extracting elements of a data frame that satisfy Boolean conditions. For example, suppose we have a data frame where the X-axis labels are features, and that we only want the parts of the dataset with some feature being positive for instance.

In [64]:
ex_dataframe_1 = pd.DataFrame(np.random.randn(4,5),  ['R1','R2','R3','R4'], ['C1','C2','C3','C4','C5'])
ex_dataframe_1

          C1        C2        C3        C4        C5
R1 -1.770777  1.959427 -0.698027  0.003315 -0.271843
R2 -1.638769  0.263598  0.184388  0.280230  0.391731
R3  0.003833 -0.278987  0.069071  0.082046  0.920773
R4  0.789961 -0.306840 -1.619309 -0.537575  0.133525

* Below, we extract all the rows that have positive entries for the 'C1' label. This passing a series of Booleans as follows:

In [65]:
ex_dataframe_1[ex_dataframe_1['C1']>0]

          C1        C2        C3        C4        C5
R3  0.003833 -0.278987  0.069071  0.082046  0.920773
R4  0.789961 -0.306840 -1.619309 -0.537575  0.133525

* We could also look at all the positive entries of the data frame. Pandas makes a data frame of Booleans as follows:

In [67]:
ex_dataframe_1>0

       C1     C2     C3     C4     C5
R1  False   True  False   True  False
R2  False   True   True   True   True
R3   True  False   True   True   True
R4   True  False  False  False   True

* An alternative is to pass the condition as an "index"/"label". The entries that don't satisfy the condition are indicated with a **NaN**

In [66]:
ex_dataframe_1[ex_dataframe_1>0]

          C1        C2        C3        C4        C5
R1       NaN  1.959427       NaN  0.003315       NaN
R2       NaN  0.263598  0.184388  0.280230  0.391731
R3  0.003833       NaN  0.069071  0.082046  0.920773
R4  0.789961       NaN       NaN       NaN  0.133525

* Now suppose we want to use several Boolean conditions. The usual "and/or" operators are not overloaded for series or data frames of Booleans. One uses **&** instead of "and", while "or" is replaced by the pipe character "**|**".

In [77]:
ex_dataframe_1[(ex_dataframe_1['C1']>0) & (ex_dataframe_1['C4']<0)]

          C1       C2        C3        C4        C5
R4  0.789961 -0.30684 -1.619309 -0.537575  0.133525

In [78]:
(ex_dataframe_1 < -1) | (ex_dataframe_1 > 1)

       C1     C2     C3     C4     C5
R1   True   True  False  False  False
R2   True  False  False  False  False
R3  False  False  False  False  False
R4  False  False   True  False  False

## **(3) Modifying row indices**

From Lecture 28 of Pierian Data's DSML Bootcamp.

In [68]:
ex_dataframe_2 = pd.DataFrame(np.random.randn(4,5),['R1','R2','R3','R4'], ['C1','C2','C3','C4','C5'])
ex_dataframe_2

          C1        C2        C3        C4        C5
R1 -1.558311  0.072063  0.241595 -1.375811 -1.901028
R2 -1.008041 -0.724948  0.504336 -0.578982 -0.865823
R3 -1.000313  0.388727  0.062914 -0.601084  0.807964
R4 -2.130442  0.776806 -0.190295  0.607961  0.439592

* Say we want to reset the row labels to usual int values. This is done using **.reset_index()**. This adds a new column with the original indices labels on the left:

In [69]:
ex_dataframe_tmp = ex_dataframe_2.reset_index()
ex_dataframe_tmp

  index        C1        C2        C3        C4        C5
0    R1 -1.558311  0.072063  0.241595 -1.375811 -1.901028
1    R2 -1.008041 -0.724948  0.504336 -0.578982 -0.865823
2    R3 -1.000313  0.388727  0.062914 -0.601084  0.807964
3    R4 -2.130442  0.776806 -0.190295  0.607961  0.439592

The reset is **not in-place** by default, and one adds **inplace=True** as an argument if needed

In [70]:
ex_dataframe_2

          C1        C2        C3        C4        C5
R1 -1.558311  0.072063  0.241595 -1.375811 -1.901028
R2 -1.008041 -0.724948  0.504336 -0.578982 -0.865823
R3 -1.000313  0.388727  0.062914 -0.601084  0.807964
R4 -2.130442  0.776806 -0.190295  0.607961  0.439592

* Another possibility is to add a new column of labels, and make the latter the new row indices. The method **.set_index('New index label')** is used for this task.

In [74]:
ex_dataframe_tmp = ex_dataframe_2
ex_dataframe_tmp['New Lbl'] = ['x', 'y', 'z', 't']
ex_dataframe_tmp

          C1        C2        C3        C4        C5 New Lbl
R1 -1.558311  0.072063  0.241595 -1.375811 -1.901028       x
R2 -1.008041 -0.724948  0.504336 -0.578982 -0.865823       y
R3 -1.000313  0.388727  0.062914 -0.601084  0.807964       z
R4 -2.130442  0.776806 -0.190295  0.607961  0.439592       t

In [76]:
ex_dataframe_tmp.set_index('New Lbl', inplace = True)
ex_dataframe_tmp

               C1        C2        C3        C4        C5
New Lbl
x       -1.558311  0.072063  0.241595 -1.375811 -1.901028
y       -1.008041 -0.724948  0.504336 -0.578982 -0.865823
z       -1.000313  0.388727  0.062914 -0.601084  0.807964
t       -2.130442  0.776806 -0.190295  0.607961  0.439592

## **(4) Multi-indexing**

From Lecture 29 of Section 6. Pandas gives the possibility of creating data frames with several layers of indexing. Each index in this case gives rise to another data frame.

**Remarks:** 
- I'll skip this part for now because it's not used frequently. Furthermore, the multi-index is itself one of Pandas objects which has to be constructed aside.

- It comes-up later when dealing with financial data in the DSML course.

**Comments:** 
- It looks like most of the methods that manipulate data frames (and series) are not in-place by default. This is a safety measure to avoid losing initial data. 
- Also, I get the impression that Pandas does not create new variables from old by creating copies, but just creates pointers. This would make sense for memory management, but it's a point that isn't addressed explicitly in the course.

_________________________

# **III - Missing Data**

This is the content of Lecture 30 of Pierian Data's DSML.

The starting point is that missing data is expected to be **NaN**. First we look at some methods to either suppress the rows/columns with missing data. For the purposes of our examples, we'll use Numpy's NaN.

In [89]:
df = pd.DataFrame({'A':[np.pi, np.e, 0.0], 'B':[3.5, np.nan, 0.1] , 'C':[np.nan, np.nan, np.random.randn()]})
df

          A    B         C
0  3.141593  3.5       NaN
1  2.718282  NaN       NaN
2  0.000000  0.1  1.530459

* Removing a row containing missing data is done using the **pd_obj.dropna(axis =0)**, dropping a column is done by passing the **axis = 1** argument.

In [90]:
df.dropna()

     A    B         C
2  0.0  0.1  1.530459

In [91]:
df.dropna(axis=1)

          A
0  3.141593
1  2.718282
2  0.000000

* One can also remove starting from a threshold, by specifying the minimum of missing entries:

In [92]:
df.dropna(axis=1, thresh =2)

          A    B
0  3.141593  3.5
1  2.718282  NaN
2  0.000000  0.1

* The next task we consider is replacing the missing values by something. The method **pd_dataframe.fillna(*New entry*)**. If we want to replace by the usual "N/A"

In [99]:
df_2 = df.fillna("N/A")
df_2

          A    B         C
0  3.141593  3.5       N/A
1  2.718282  N/A       N/A
2  0.000000  0.1  1.530459

* In data science, it's often useful to replace missing entries by the average of the column:

In [110]:
df_avg_col = df
df_avg_col['C'] = df_avg_col['C'].fillna(df_avg_col['C'].mean())
df_avg_col['B'] = df_avg_col['B'].fillna(df_avg_col['B'].mean())
df_avg_col

          A    B         C
0  3.141593  3.5  1.530459
1  2.718282  1.8  1.530459
2  0.000000  0.1  1.530459

In [109]:
df_4

A    3.141593
B    3.500000
C         NaN
Name: 0, dtype: float64

________________________________________

# **IV - Groupby**

Contents of Lecture 31. The idea of a groupby function is to group rows based off of a column and perform some aggregate function (e.g. taking average, std or variance). In the particular case of Pandas, the **pd_dataframe.Groupby(*Column lbl*)** creates a DataFrameGroupBy object, which is expected to be treated by another function to produce a new data frame.

In [113]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

* First we apply **.Groupby('Company')** to the above data frame. Secondly, we create a new frame by applying a function:

In [115]:
df_sum_company = df.groupby('Company').sum()
df_sum_company

         Sales
Company
FB         593
GOOG       320
MSFT       464

* There's a very useful built-in function for the type of aggregate functions used with groupby, called **.describe()**

In [120]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [119]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

________________________________________

# **V - Merging, joining and concatenating**

### **(2021/07/08)**

Contents of Lecture 32. I'll use Pierian Data's examples on Github.

## **(1) Concatenation of data frames**

In [3]:
# 3 example data frames
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

* The example dataframes look like this:

In [5]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [6]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [7]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

* Concatenation is done with **pd.concat**. The main argument is a list of the data frames to be concatenated. First example is concatenation along rows (default axis 0), second one is along columns (axis 1).

In [8]:
df_concat_rows = pd.concat([df1,df2,df3])
df_concat_rows

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [10]:
df_concat_cols = pd.concat([df1,df2,df3], axis =1)
df_concat_cols

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

**Note:** This concatenation along columns is not very intuitive, it adds rows too (it behaves like a direct sum of matrices for some reason). To concatenate along columns one uses pd.merge() or pd.join().

## **(2) Merging data frames**

Next we look at merging. The first example is two data frames that share **one** key.

In [11]:
dfk_AB = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
dfk_CD = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [12]:
dfk_AB

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [13]:
dfk_CD

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

* Now merge along the **key** column, using **pd.merge(*Left df*, *Right df*, *how*, *on*)**. Using **on = 'key'**:

In [15]:
dfk_ABCD = pd.merge(dfk_AB, dfk_CD, on = 'key')
dfk_ABCD

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

Going back to the signature **pd.merge(*Left df*, *Right df*, *how*, *on*)**, this function looks for intersections of labels by default. 

The **how** parameter takes the following values (from help):
* left: use only keys from left frame, similar to a SQL left outer join; preserve key order.
* right: use only keys from right frame, similar to a SQL right outer join; preserve key order.
* outer: use union of keys from both frames, similar to a SQL full outer join; sort keys lexicographically.
* inner: use intersection of keys from both frames, similar to a SQL inner join; preserve the order of the left keys.
* cross: creates the cartesian product from both frames, preserves the order of the left keys.

The **on** parameter takes lists of labels. In the next example, we merge along more than one label:

In [28]:
dfl = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
dfr = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [29]:
pd.merge(dfl, dfr, on = ['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [30]:
pd.merge(dfl, dfr, how = 'outer', on = ['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [31]:
pd.merge(dfl, dfr, how = 'left', on = ['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [32]:
pd.merge(dfl, dfr, how = 'right', on = ['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

I have no idea how this works, but it doesn't seem crucial to understand right now.

## **(3) Joining data frames**

The join functions do the usual concatenation along columns, even if the rows are indexed differently. This is done with the built-in data frame method ***pd_dframe*.join(*dframe_right*, *on*, *how*)**. If we have the same indices (i.e. labels for rows):

In [33]:
dfl = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

dfr = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [34]:
dfl.join(dfr)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [36]:
dfl.join(dfr, how = 'outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

**Roughly speaking:** .join() does the same thing as pd.merge(), the difference is that .join() concatenates columns following the indices of data frames, while pd.merge() concatenates according to a column of chosen label.

________________________________________

# **VI - More operations on data frames**

This is Lecture 33, in which Portilla does some reminders on previously discussed topics (conditional selection and the .drop method) and introduces new useful functionalities of Pandas. Here the example data frame that he works with:

In [37]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head() # This one displays the table. See help.

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

## **(1) The apply method**

We have seen that Pandas has built-in series methods such as .sum(), .mean() etc. Now the ***pd_dataframe*.apply(*function*)** method allows one to use custom functions on the contents of a series. Here, *we pass a function as an argument*, and this method becomes particularly powerful when combined with lambda expressions.

* Suppose we want to square the numbers in 'col2' of the main example:

In [38]:
df['col2'].apply(lambda x: x**2)

0    197136
1    308025
2    443556
3    197136
Name: col2, dtype: int64

* Let's look at the lengths of strings in 'col3':

In [41]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

## **(2) Index and column attributes**

These attributes of data frames are useful for data analysis:

- ***pd_dataframe*.index** is the index range for the rows.

- ***pd_dataframe*.columns** is the list of column labels.

In [43]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [44]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

## **(3) Methods for sorting, unique values, and null entries**

* **Null entries**: ***pd_dataframe*.isnull()** returns a Boolean data frame for whether or not an entry is null

In [45]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

Taking the examples in section V (on joining):

In [46]:
dfl.join(dfr, how = 'outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [47]:
dfl.join(dfr, how = 'outer').isnull()

        A      B      C      D
K0  False  False  False  False
K1  False  False   True   True
K2  False  False  False  False
K3   True   True  False  False

* **Sorting by values in a column**: A very important/useful method in practice, done with ***pd_dataframe*.sort_values(by=*column*)**. If we sort the main example here by 'col2', we get:

In [48]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

* **Extracting and counting unique values**: First, ***pd_series*.unique()** will return the **list** of unique values in a series:

In [49]:
df['col3'].unique()

array(['abc', 'def', 'ghi', 'xyz'], dtype=object)

* The method ***pd_series*.nunique()** counts the number of unique values:

In [50]:
df['col2'].nunique()

3

* And the method ***pd_series*.value_counts()** combines .unique() and nunique():

In [51]:
df['col2'].value_counts()

444    2
666    1
555    1
Name: col2, dtype: int64

## **(4) Pivot tables (sneak peek)**

In this part we'll use:

In [52]:
data_pivtb = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df_pivtb = pd.DataFrame(data_pivtb)
df_pivtb.head()

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4

No in-depth discussion, and related to data frames with multi-indices. The method ***pd_dataframe*.pivot_table()** re-arranges a data frame. For the table above, we aggregate the labels in the 'A' and 'B' columns, and we sum the values in 'D' according to the labels in col. 'C':

In [54]:
df_pivtb.pivot_table(values='D',index=['A', 'B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

**Remark:** Portilla said not worry too much about it if we haven't worked much with pivot tables before. The idea is to rearrange the data to get statistics (above, we had a sum).

________________________________________

# **VII - Data input and output**

* Contents of Lecture 34. So Pandas allows to read files several file types, the ones of interest here being CSV, Excel, HTML and SQL (I'm not doing the latter). 

* Reading a specific file type is done using **pd.read_*file-type***, and a full list of supported types can be seen when pressing tab. Note that Pandas stores the contents in a variable (typically a data frame).

* To export a data frame into one of the supported format, one uses **pd_dataframe.to_*file-type***. This creates a new file.

## **(1) CSV files**

* Reading a file is a function from the Pandas library:

In [59]:
ex_df_csvread = pd.read_csv("CSV_example.csv")
ex_df_csvread.head()

     Label A   Label B   Label C   Label D
0    'Alpha'        33     185.0     100.0
1     'Beta'        26     190.0     120.0
2    'Gamma'        67     178.0      75.0
3    'Delta'        40     180.0      95.0
4  'Epsilon'         2       0.9       9.0

In [62]:
ex_df_csvread['Label A']

0      'Alpha'
1       'Beta'
2      'Gamma'
3      'Delta'
4    'Epsilon'
Name: Label A, dtype: object

In [63]:
ex_df_csvread.loc[2]

Label A     'Gamma'
 Label B         67
 Label C      178.0
 Label D       75.0
Name: 2, dtype: object

* Let's create an example by hand.

In [55]:
ex_randf = pd.DataFrame(np.random.randn(4,5), columns=['A','B','C','D','E'])
ex_randf.head()

          A         B         C         D         E
0  0.983721 -0.137858 -0.515961 -0.591255  1.834304
1  0.232334 -0.263151 -1.182703  0.889994  0.141316
2  1.817904  0.445601 -1.611546  0.792023  0.331313
3 -0.172285  0.082218 -0.286894  0.267736  0.443160

* Saving into a file is a **method**:

In [56]:
ex_randf.to_csv('Randn_4x5_dataframe.csv')

## **(2) Excel files**

**Important note:** Obviously, Pandas will only import the data from an excel file, not the macros, images etc. In fact, **read_excel() will crash if the xlsx stores this type of content.** Here, we need to specify the sheet name with **sheet_name=*name***.

**Remark:** In Lecture 34, portilla uses **sheetname** for reading, but the course was made a while back (2015) and it could have been updated to **sheet_name** since then.

In [68]:
ex_df_quant_salaries = pd.read_excel("Hedge_funds_salaries.xlsx", sheet_name='210708')
ex_df_quant_salaries.head()

,Organization,Year founded,AUM (B$),No. Employees,Avg. Quant Salary (k$/yr)
0,Renaissance Technologies,1982,165.0,310,178.0
1,Radix Trading LLC,2014,NaN,43,130.0
2,Jane Street Capital,1999,4.0,1200,143.0
3,Citadel LLC,1990,35.0,1400,184.0
4,Winton Group,1997,22.0,412,NaN

In [69]:
ex_df_quant_salaries.sort_values('Avg. Quant Salary (k$/yr)')

,Organization,Year founded,AUM (B$),No. Employees,Avg. Quant Salary (k$/yr)
1,Radix Trading LLC,2014,NaN,43,130.0
2,Jane Street Capital,1999,4.0,1200,143.0
0,Renaissance Technologies,1982,165.0,310,178.0
3,Citadel LLC,1990,35.0,1400,184.0
4,Winton Group,1997,22.0,412,NaN

* Next, we output to an excel file. We'll use:

In [70]:
ex_randf = pd.DataFrame(np.random.randn(4,5), columns=['A','B','C','D','E'])
ex_randf.head()

          A         B         C         D         E
0 -0.280914 -0.139458 -0.873773 -0.839426  2.287882
1  1.657967 -0.965220  0.576219  0.392580  0.570431
2  0.780676  1.472632 -0.239467 -0.582996  0.104433
3 -0.590706  0.572160  0.998873 -0.644336  0.586896

In [71]:
ex_randf.to_excel("Ex_RandN_DataFrame.xlsx", sheet_name = "Sample 1")

The output is very clean.

## **(3) HTML**

The good news about this part is that there's no web scraping required. Pandas automatically reads the HTML code of a page and converts the table classes into data frame objects.

For our example, we'll extract the tables from David Lynch's filmography on Wikipedia:

In [72]:
df_david_lynch_filmography = pd.read_html("https://en.wikipedia.org/wiki/David_Lynch_filmography")

In [73]:
# Number of tables
len(df_david_lynch_filmography)

14

* The first table is the table of contents of the Wiki page, the second one is Lynch's works as a director:

In [75]:
df_david_lynch_filmography[1]

,Year,Title,Director,Writer,Producer,Notes,Ref(s)
0,1977,Eraserhead,Yes,Yes,Yes,"Also editor, composer, art director, and speci...",[17]
1,1980,The Elephant Man,Yes,Yes,No,Also musical director and sound designer;co-wr...,[17]
2,1984,Dune,Yes,Yes,No,NaN,[17]
3,1986,Blue Velvet,Yes,Yes,No,NaN,[17]
4,1990,Wild at Heart,Yes,Yes,No,NaN,[17]
5,1992,Twin Peaks: Fire Walk with Me,Yes,Yes,Executive,Also sound designer;co-written with Robert Engels,[17]
6,1997,Lost Highway,Yes,Yes,No,Also sound designer;co-written with Barry Gifford,[17]
7,1999,The Straight Story,Yes,No,No,Also sound designer,[17]
8,2001,Mulholland Drive,Yes,Yes,No,Also sound designer,[17]
9,2006,Inland Empire,Yes,Yes,Yes,"Also editor, cinematographer and sound designer",[17]

**Remark:** Note that above, we did not import any library other than Pandas and Numpy for the html conversion etc. In the beginning of Lecture 34, it is specified that the packages **Beautiful Soup 4, html5lib and lxml** have to be installed though.

______________